In [3]:
from numpy import nan as NA

In [4]:
import pandas as pd

In [5]:
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                    [NA,NA,NA,],[NA,6.5,3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [13]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1,how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
import numpy as np

In [18]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  0.219853       NaN       NaN
1  1.282641       NaN       NaN
2 -0.431877       NaN  0.930278
3  2.529152       NaN -0.217743
4 -0.029756  2.903861 -0.231080
5 -0.172738  0.472887  0.614895
6 -1.646745  0.516801 -0.128349

In [19]:
df.dropna()

          0         1         2
4 -0.029756  2.903861 -0.231080
5 -0.172738  0.472887  0.614895
6 -1.646745  0.516801 -0.128349

In [20]:
df.dropna(thresh=2)

          0         1         2
2 -0.431877       NaN  0.930278
3  2.529152       NaN -0.217743
4 -0.029756  2.903861 -0.231080
5 -0.172738  0.472887  0.614895
6 -1.646745  0.516801 -0.128349

In [21]:
df.fillna(0)

          0         1         2
0  0.219853  0.000000  0.000000
1  1.282641  0.000000  0.000000
2 -0.431877  0.000000  0.930278
3  2.529152  0.000000 -0.217743
4 -0.029756  2.903861 -0.231080
5 -0.172738  0.472887  0.614895
6 -1.646745  0.516801 -0.128349

In [22]:
df.fillna({1:0.5,2:0})

          0         1         2
0  0.219853  0.500000  0.000000
1  1.282641  0.500000  0.000000
2 -0.431877  0.500000  0.930278
3  2.529152  0.500000 -0.217743
4 -0.029756  2.903861 -0.231080
5 -0.172738  0.472887  0.614895
6 -1.646745  0.516801 -0.128349

In [23]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0  0.219853  0.000000  0.000000
1  1.282641  0.000000  0.000000
2 -0.431877  0.000000  0.930278
3  2.529152  0.000000 -0.217743
4 -0.029756  2.903861 -0.231080
5 -0.172738  0.472887  0.614895
6 -1.646745  0.516801 -0.128349

In [24]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.286266 -0.376082 -2.219384
1  0.250819 -0.335566  1.091640
2 -0.162995       NaN  0.332469
3 -0.884573       NaN -0.385445
4 -0.910028       NaN       NaN
5  0.989226       NaN       NaN

In [25]:
df.fillna(method="ffill")

          0         1         2
0  0.286266 -0.376082 -2.219384
1  0.250819 -0.335566  1.091640
2 -0.162995 -0.335566  0.332469
3 -0.884573 -0.335566 -0.385445
4 -0.910028 -0.335566 -0.385445
5  0.989226 -0.335566 -0.385445

In [26]:
df.fillna(method="ffill",limit=2)

          0         1         2
0  0.286266 -0.376082 -2.219384
1  0.250819 -0.335566  1.091640
2 -0.162995 -0.335566  0.332469
3 -0.884573 -0.335566 -0.385445
4 -0.910028       NaN -0.385445
5  0.989226       NaN -0.385445

In [28]:
data =  pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [29]:
data = pd.DataFrame({"k1" : ["one","two"] * 3 +["two"],
                     "k2" : [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [32]:
data["v1"] = range(7)
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [50]:
data = pd.DataFrame({"food" : ["bacon","pulled pork","bacon",
                               "Pastrami","corned beef","Bacon",
                               "pastrami","honey ham","nova lox"],
                               "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {
    "bacon": "pig",
    "pulled pork" : "pig",
    "pastrami" : "cow",
     "corned beef" : "cow",
    "honey ham" : "pig",
    "nova lox" : "salmon"
}

In [39]:
lowercased = data["food"].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [40]:
data["animal"] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     pig
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     NaN
8     nova lox     6.0  salmon

In [55]:
data["food"].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [43]:
data = pd.Series([1.,-999.,2,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [44]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [45]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [46]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=["0hio","Colorado","New York"],
                   columns=["one","two","three","four"])
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['0HIO', 'COLO', 'NEW '], dtype='object')

In [58]:
data.index = data.index.map(transform)
data

      one  two  three  four
0HIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [59]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
0Hio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [63]:
data.rename(index={"OHIO" : "INDIANA"},
            columns={"three" : "peekaboo"})

      one  two  peekaboo  four
0HIO    0    1         2     3
COLO    4    5         6     7
NEW     8    9        10    11

In [68]:
data.rename(index={"OHIO":"INDIANA"},inplace=True)
data

      one  two  three  four
0HIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [70]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [72]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [73]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [74]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [75]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.031055    -0.042549    -0.015809     0.053133
std       0.983126     0.980344     0.996815     1.002361
min      -2.830388    -3.603582    -2.871034    -3.077230
25%      -0.725358    -0.704800    -0.671227    -0.655744
50%      -0.041673    -0.019576    -0.061701     0.051248
75%       0.635608     0.655380     0.657133     0.709782
max       3.571059     3.113647     3.434106     3.408062

In [76]:
col = data[2]
col[np.abs(col) > 3]

515    3.434106
Name: 2, dtype: float64

In [77]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.031741    -0.042059    -0.016243     0.052802
std       0.980832     0.977973     0.995405     1.000838
min      -2.830388    -3.000000    -2.871034    -3.000000
25%      -0.725358    -0.704800    -0.671227    -0.655744
50%      -0.041673    -0.019576    -0.061701     0.051248
75%       0.635608     0.655380     0.657133     0.709782
max       3.000000     3.000000     3.000000     3.000000

In [79]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0 -1.0  1.0  1.0
3 -1.0 -1.0 -1.0  1.0
4 -1.0  1.0  1.0 -1.0

In [80]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([0, 1, 3, 2, 4])

In [81]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [82]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19

In [83]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15

In [84]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

4    4
1    7
3    6
3    6
4    4
4    4
2   -1
4    4
2   -1
4    4
dtype: int64

In [88]:
df = pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1": range(6)})
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [90]:
dummies = pd.get_dummies(df["key"], prefix="key")
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [91]:
dummies = pd.get_dummies(df["key"],prefix="key")
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [95]:
val ="a,b guido"
val.split(",")

['a', 'b guido']

In [97]:
pieces = [x.strip()for x in val.split(",")]
pieces

['a', 'b guido']